In [1]:
import pandas as pd

#### Q1. List any five functions of the pandas library with execution.

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
len(df)

891

In [6]:
df.iloc[0:2,[0,1,2]]

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1

In [7]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [8]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
df['Age'].mean()

29.69911764705882

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [10]:
def reindex_dataframe(df):
    new_index = range(1, len(df) * 2, 2)
    df = df.set_index(pd.Index(new_index))
    return df

df = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]})
df

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function thatiterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [11]:
df1=pd.DataFrame({'Value':[10,20,30,40,50]})

In [12]:
df1

   Value
0     10
1     20
2     30
3     40
4     50

In [13]:
df1.iloc[0:3,[0]].sum()

Value    60
dtype: int64

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [39]:
data=['ffer','utkarsh','vishal']
df2=pd.DataFrame({'text':data})

In [40]:
df2

      text
0     ffer
1  utkarsh
2   vishal

In [41]:
def word_count(s):
    count=0
    ls=[]
    for i in s:
        for j in i:
            count+=1
        ls.append(count)
        count=0
    return ls

In [42]:
ls=word_count(df2['text'])

In [64]:
df2['word_count']=ls

In [65]:
df2

      text  word_count
0     ffer           4
1  utkarsh           7
2   vishal           6

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [48]:
df2.size

6

In [49]:
df2.shape

(3, 2)

df.size returns the number of elements present in the dataframe whereas df.shape returns the dimensions of the dataframe.

#### Q6. Which function of pandas do we use to read an excel file?

In [51]:
#we use pd.read_excel() to read exel filee
df3=pd.read_excel('vgsales_part 3 COMPLETED.xlsx')

In [52]:
df3

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains emailaddresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [55]:
df4=pd.DataFrame({'Email':['john@gmail.com','utkarsh@gmail.com','vishal@gmail.com']})

In [56]:
df4

               Email
0     john@gmail.com
1  utkarsh@gmail.com
2   vishal@gmail.com

In [57]:
s="jogh@gmail"
u=s.split('@')
u

['jogh', 'gmail']

In [66]:
def name(df):
    un=[]
    for i in df:
        un.append(i.split('@')[0])
    return un

In [67]:
un=name(df4['Email'])

In [68]:
un

['john', 'utkarsh', 'vishal']

In [69]:
df4['Username']=un

In [70]:
df4

               Email Username
0     john@gmail.com     john
1  utkarsh@gmail.com  utkarsh
2   vishal@gmail.com   vishal

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [71]:
df5=pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [72]:
temp=df5[(df5['A']>5) & (df5['B']<10)]

In [73]:
temp

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [74]:
df1

   Value
0     10
1     20
2     30
3     40
4     50

In [78]:
df1['Value'].standard_deviation()

AttributeError: 'Series' object has no attribute 'standard_deviation'

In [79]:
def agg(df):
    mean=df.mean()
    median=df.median()
    std=df.std()
    return mean,median,std

In [82]:
mean,median,std=agg(df1['Value'])

In [83]:
mean

30.0

In [84]:
median

30.0

In [85]:
std

15.811388300841896

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [145]:
sales_df=pd.DataFrame({'Date': pd.date_range('2023-06-01', periods=10, freq='D'),
        'Sales': [100, 120, 80, 110, 130, 90, 70, 150, 140, 160]})

In [146]:
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

In [147]:
df_with_ma = calculate_moving_average(sales_df)

In [148]:
df_with_ma

        Date  Sales  MovingAverage
0 2023-06-01    100     100.000000
1 2023-06-02    120     110.000000
2 2023-06-03     80     100.000000
3 2023-06-04    110     102.500000
4 2023-06-05    130     108.000000
5 2023-06-06     90     105.000000
6 2023-06-07     70     100.000000
7 2023-06-08    150     107.142857
8 2023-06-09    140     110.000000
9 2023-06-10    160     121.428571

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a newcolumn 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [118]:
rng=pd.date_range('2023-01-01',periods=5,freq='D')
df6=pd.DataFrame({'Date':rng})

In [119]:
df6

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [121]:
df6.dtypes

Date    datetime64[ns]
dtype: object

In [149]:
def add_weekday_column(df):
    df['Weekday'] = df['Date'].dt.day_name()
    return df

In [150]:
df_new=add_weekday_column(df6)
df_new

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday